nam348tnh3gp/ESP32-Repeater/src/ESP_Code.ino
/*
   ESP32 NAT ROUTER - V21.1.0 (Configurable NAT + RAM Warning)
   - Đã sửa lỗi tương thích Arduino core 3.x cho ESP32-C5
*/

#include <Arduino.h>
#include <DNSServer.h>
#include <AsyncTCP.h>
#include <ESPAsyncWebServer.h>
#include <ArduinoJson.h>
#include <Preferences.h>
#include <esp_task_wdt.h>
#include <esp_wifi.h>
#include <esp_netif.h>
#include <esp_chip_info.h>
#include <atomic>

// ================= PLATFORM DETECTION =================
#if defined(ARDUINO_ARCH_ESP32)
    #define PLATFORM_ARDUINO 1
    #if defined(ESP_ARDUINO_VERSION_VAL)
        #define ARDUINO_CORE_VERSION_MAJOR ESP_ARDUINO_VERSION_MAJOR
    #else
        #define ARDUINO_CORE_VERSION_MAJOR 2
    #endif
#else
    #define PLATFORM_ARDUINO 0
#endif

// Conditional includes cho lwIP (chỉ ESP-IDF hoặc Arduino core cũ)
#if !PLATFORM_ARDUINO || (PLATFORM_ARDUINO && ARDUINO_CORE_VERSION_MAJOR < 3)
    #include <lwip/napt.h>
    #include <lwip/netif.h>
    #include <lwip/priv/tcpip_priv.h>
    #include <lwip/etharp.h>
#endif

// ================= TEMPERATURE SENSOR =================
#ifndef CONFIG_IDF_TARGET_ESP32C5
#include <esp_temp_sensor.h>
#endif

// ================= BOARD DETECTION =================
#define CHANNEL_2G_MIN 1
#define CHANNEL_2G_MAX 13
#define CHANNEL_5G_MIN 36
#define CHANNEL_5G_MAX 165
#define CHANNEL_5G_36 36
#define CHANNEL_5G_40 40
#define CHANNEL_5G_44 44
#define CHANNEL_5G_48 48
#define CHANNEL_5G_149 149
#define CHANNEL_5G_153 153
#define CHANNEL_5G_157 157
#define CHANNEL_5G_161 161

#ifndef LED_BUILTIN
#define LED_BUILTIN 2
#endif

// ================= KERNEL DEFINITIONS =================
#define DEFAULT_NAPT_SLOTS 512
#define DEFAULT_NAPT_TCP   256
#define MEM_CRITICAL_THRESHOLD 26000 
#define WATCHDOG_TIMEOUT 45
#define MAX_SCAN_NETWORKS 10
#define DEFAULT_MAX_CLIENTS 7
#define TEMP_UPDATE_INTERVAL 5000

// AP Config Defaults
#define DEFAULT_AP_CHANNEL 1
#define DEFAULT_AP_HIDDEN 0
#define DEFAULT_BAND_5GHZ 0
#define MIN_CLIENTS 1
#define MAX_CLIENTS_LIMIT 10

// DNS Mode
#define DNS_MODE_CAPTIVE 0
#define DNS_MODE_NORMAL 1
#define DEFAULT_DNS_MODE DNS_MODE_CAPTIVE

IPAddress AP_IP(192, 168, 4, 1);
IPAddress AP_GATEWAY(192, 168, 4, 1);
IPAddress AP_SUBNET(255, 255, 255, 0);

DNSServer dns;
AsyncWebServer server(80);
AsyncWebSocket ws("/ws");
Preferences prefs;

String sta_ssid, sta_pass, ap_ssid, ap_pass;
std::atomic<bool> internetOK{false}, natEnabled{false};
std::atomic<int> lastRSSI{-100}, lastTemp{0};
std::atomic<bool> scanInProgress{false};
std::atomic<int> currentClients{0};
unsigned long uptimeStart = 0;

// AP Config variables
int ap_channel = DEFAULT_AP_CHANNEL;
bool ap_hidden = DEFAULT_AP_HIDDEN;
int max_clients = DEFAULT_MAX_CLIENTS;
int dns_mode = DEFAULT_DNS_MODE;
bool use_5ghz = DEFAULT_BAND_5GHZ;

// NAT Config variables
int nat_max_slots = DEFAULT_NAPT_SLOTS;
int nat_max_tcp   = DEFAULT_NAPT_TCP;

// Board info
bool board_supports_5ghz = false;
String board_model = "Unknown";

// ================= PLATFORM-SPECIFIC NAT FUNCTIONS =================
#if PLATFORM_ARDUINO && ARDUINO_CORE_VERSION_MAJOR >= 3
    // Arduino core 3.x - dùng API chính thức
    void enableNAT() {
        if (WiFi.status() == WL_CONNECTED && !natEnabled.load()) {
            if (WiFi.AP.enableNAPT(true)) {
                natEnabled.store(true);
                Serial.println("✅ NAT Enabled via Arduino API");
            } else {
                Serial.println("❌ Failed to enable NAT");
            }
        }
    }

    void disableNAT() {
        if (natEnabled.load()) {
            WiFi.AP.enableNAPT(false);
            natEnabled.store(false);
            Serial.println("⚠️ NAT Disabled");
        }
    }

    void initNAT() {
        Serial.printf("✅ NAT ready (Arduino core) - slots:%d, tcp:%d\n", nat_max_slots, nat_max_tcp);
    }
#else
    // ESP-IDF hoặc Arduino core cũ - dùng lwIP native API
    #define LOCK_TCPIP_CORE()   sys_lock_tcpip_core()
    #define UNLOCK_TCPIP_CORE() sys_unlock_tcpip_core()

    void enableNAT() {
        if (WiFi.status() == WL_CONNECTED && !natEnabled.load()) {
            LOCK_TCPIP_CORE();
            if (ip_napt_enable(WiFi.localIP(), 1)) {
                natEnabled.store(true);
                Serial.println("✅ NAT Enabled via lwIP");
            }
            UNLOCK_TCPIP_CORE();
        }
    }

    void disableNAT() {
        if (natEnabled.load()) {
            LOCK_TCPIP_CORE();
            ip_napt_disable();
            UNLOCK_TCPIP_CORE();
            natEnabled.store(false);
            Serial.println("⚠️ NAT Disabled");
        }
    }

    void initNAT() {
        LOCK_TCPIP_CORE();
        ip_napt_disable();
        ip_napt_init(nat_max_slots, nat_max_tcp);
        UNLOCK_TCPIP_CORE();
        Serial.printf("✅ NAT initialized: slots=%d, tcp_ports=%d\n", nat_max_slots, nat_max_tcp);
    }
#endif

// ================= UTILS =================
String urlDecode(String str) {
    String decoded = "";
    char ch; int i, j;
    for (i = 0; i < str.length(); i++) {
        if (str[i] == '%') {
            sscanf(str.substring(i + 1, i + 3).c_str(), "%x", &j);
            ch = (char)j; decoded += ch; i += 2;
        } else if (str[i] == '+') {
            decoded += ' ';
        } else {
            decoded += str[i];
        }
    }
    return decoded;
}

// ================= BOARD DETECTION =================
void detectBoardCapabilities() {
    esp_chip_info_t chip_info;
    esp_chip_info(&chip_info);

    switch(chip_info.model) {
        case CHIP_ESP32:    board_model = "ESP32"; board_supports_5ghz = false; break;
        case CHIP_ESP32S2:  board_model = "ESP32-S2"; board_supports_5ghz = false; break;
        case CHIP_ESP32S3:  board_model = "ESP32-S3"; board_supports_5ghz = false; break;
        case CHIP_ESP32C3:  board_model = "ESP32-C3"; board_supports_5ghz = false; break;
        case CHIP_ESP32C5:  board_model = "ESP32-C5"; board_supports_5ghz = true; break;
        case CHIP_ESP32C6:  board_model = "ESP32-C6"; board_supports_5ghz = false; break;
        case CHIP_ESP32H2:  board_model = "ESP32-H2"; board_supports_5ghz = false; break;
        case CHIP_ESP32P4:  board_model = "ESP32-P4"; board_supports_5ghz = false; break;
        default:            board_model = "ESP32 (Unknown)"; board_supports_5ghz = false; break;
    }

    Serial.printf("🔍 Board Detected: %s\n", board_model.c_str());
    Serial.printf("📡 5GHz Support: %s\n", board_supports_5ghz ? "YES" : "NO");
    Serial.printf("🖥️ Platform: %s\n", PLATFORM_ARDUINO ? "Arduino IDE" : "ESP-IDF");

    if (!board_supports_5ghz && use_5ghz) {
        use_5ghz = false;
        Serial.println("⚠️ Board does not support 5GHz - Forcing 2.4GHz mode");
    }
}

// ================= VALIDATION =================
bool isValidChannel(int ch, bool is5GHz) {
    if (!board_supports_5ghz && is5GHz) return false;
    if (is5GHz) return (ch >= CHANNEL_5G_MIN && ch <= CHANNEL_5G_MAX);
    return (ch >= CHANNEL_2G_MIN && ch <= CHANNEL_2G_MAX);
}

int validateChannel(int ch, bool is5GHz) {
    if (!board_supports_5ghz && is5GHz) {
        return DEFAULT_AP_CHANNEL;
    }
    if (isValidChannel(ch, is5GHz)) return ch;
    return is5GHz ? CHANNEL_5G_36 : DEFAULT_AP_CHANNEL;
}

int validateMaxClients(int clients) {
    if (clients >= MIN_CLIENTS && clients <= MAX_CLIENTS_LIMIT) return clients;
    return DEFAULT_MAX_CLIENTS;
}

String validateAPPassword(String pwd) {
    if (pwd.length() == 0) return "12345678";
    if (pwd.length() < 8) return "12345678";
    return pwd;
}

int validateNATSlots(int slots, int tcp_ports) {
    if (slots < 64) slots = 64;
    if (slots > 4096) slots = 4096;
    if (slots < tcp_ports) slots = tcp_ports;
    return slots;
}

int validateNATTCP(int tcp) {
    if (tcp < 32) tcp = 32;
    if (tcp > 2048) tcp = 2048;
    return tcp;
}

// ================= TEMPERATURE =================
float getTemperature() {
#ifdef CONFIG_IDF_TARGET_ESP32C5
    return 0.0f;
#else
    float temp;
    if (temp_sensor_read_celsius(&temp) == ESP_OK) return temp;
    return 0.0f;
#endif
}

