nam348tnh3gp/ESP32-Repeater/src/ESP_Code.ino
// ================= DNS =================
void setupDNS() {
    if (dns_mode == DNS_MODE_CAPTIVE) {
        dns.start(53, "*", AP_IP);
        Serial.println("✅ DNS Captive Portal Mode");
    } else {
        dns.start(53, "*", IPAddress(0, 0, 0, 0));
        Serial.println("✅ DNS Normal Mode");
    }
}

// ================= WIFI EVENT HANDLER =================
void wifiEventHandler(void* arg, esp_event_base_t event_base, int32_t event_id, void* event_data) {
    if (event_base == WIFI_EVENT && event_id == WIFI_EVENT_AP_STACONNECTED) {
        currentClients.fetch_add(1);
        Serial.printf("✅ Client connected | Total: %d/%d\n", currentClients.load(), max_clients);
    }
    else if (event_base == WIFI_EVENT && event_id == WIFI_EVENT_AP_STADISCONNECTED) {
        int newCount = currentClients.fetch_sub(1) - 1;
        if (newCount < 0) currentClients.store(0);
        Serial.printf("❌ Client disconnected | Total: %d/%d\n", currentClients.load(), max_clients);
    }
}

// ================= GET IP FROM MAC =================
#if !PLATFORM_ARDUINO || (PLATFORM_ARDUINO && ARDUINO_CORE_VERSION_MAJOR < 3)
struct netif* getAPNetif() {
    esp_netif_t *ap_esp_netif = esp_netif_get_handle_from_ifkey("WIFI_AP_DEF");
    if (ap_esp_netif != NULL) {
        return esp_netif_get_netif_impl(ap_esp_netif);
    }
    struct netif *netif_ap = netif_list;
    while (netif_ap != NULL) {
        if ((netif_ap->name[0] == 'a' && netif_ap->name[1] == 'p') ||
            (netif_ap->name[0] == 's' && netif_ap->name[1] == 't')) {
            return netif_ap;
        }
        netif_ap = netif_ap->next;
    }
    return NULL;
}

String getIPFromMAC(uint8_t* mac) {
    struct netif *netif_ap = getAPNetif();
    if (netif_ap == NULL) return "No AP Netif";

    ip4_addr_t *ip_found = NULL;

    for (int i = 0; i < ARP_TABLE_SIZE; i++) {
        struct etharp_entry *entry = &arp_table[i];
        if (entry->state == ETHARP_STATE_STABLE || entry->state == ETHARP_STATE_PENDING) {
            if (memcmp(entry->ethaddr.addr, mac, ETH_HWADDR_LEN) == 0) {
                ip_found = &entry->ipaddr;
                break;
            }
        }
    }

    if (ip_found != NULL) {
        char ip_str[16];
        ip4addr_ntoa_r(ip_found, ip_str, sizeof(ip_str));
        return String(ip_str);
    }
    return "Pending...";
}
#else
String getIPFromMAC(uint8_t* mac) {
    wifi_sta_list_t sta_list;
    esp_wifi_ap_get_sta_list(&sta_list);
    for (int i = 0; i < sta_list.num; i++) {
        if (memcmp(sta_list.sta[i].mac, mac, 6) == 0) {
            return "Connected";
        }
    }
    return "Unknown";
}
#endif

// ================= HTML UI =================
const char index_html[] PROGMEM = R"rawliteral(
<!DOCTYPE html><html><head><meta charset='UTF-8'><meta name='viewport' content='width=device-width, initial-scale=1'>
<title>APEX ULTRA V21.1.0</title>
<style>
*{box-sizing:border-box;}
body{font-family:Arial,sans-serif;background:#020617;color:#f8fafc;padding:15px;margin:0;}
.card{background:#1e293b;padding:20px;margin-bottom:15px;border-radius:12px;border:1px solid #334155;}
input,select{width:100%;padding:12px;margin:8px 0;border-radius:8px;background:#0f172a;color:white;border:1px solid #334155;}
button{width:100%;padding:14px;background:#38bdf8;color:#020617;border:none;border-radius:8px;font-weight:bold;cursor:pointer;}
.badge{padding:4px 8px;border-radius:6px;display:inline-block;}
.ok{color:#10b981;} .bad{color:#ef4444;}
.warning{color:#f59e0b;}
</style></head><body>
<div class='card'>
  <h3>🛡️ APEX ULTRA V21.1.0 (NAT Configurable)</h3>
  <div id='boardInfo'></div>
  <div>📊 RAM: <b id='ram'>0</b> KB</div>
  <div>🌡️ Temp: <b id='temp'>--</b> °C</div>
  <div>🌐 Net: <span id='net' class='badge'>WAIT</span></div>
  <div>🔁 NAT: <span id='nat' class='badge'>WAIT</span></div>
  <div>📱 Clients: <b id='clientCount'>0</b> / <b id='clientLimit'>0</b></div>
</div>

<div class='card'>
  <h3>📡 Uplink Configuration</h3>
  <button id='scanBtn'>🔍 Scan WiFi</button>
  <form action='/save-sta' method='get'>
    <input name='ssid' id='ssidInp' placeholder='WiFi Name' required>
    <input name='pass' type='password' placeholder='Password'>
    <button type='submit'>🚀 Connect</button>
  </form>
</div>

<div class='card'>
  <h3>🎛️ Access Point Configuration</h3>
  <form action='/save-ap' method='get'>
    <input name='ssid' placeholder='AP SSID' value='APEX_ULTRA'>
    <input name='pass' type='password' placeholder='AP Password (min 8)'>
    <input name='channel' placeholder='Channel (1-13 hoặc 36-165)' value='1'>
    <button type='submit'>💾 Save & Reboot</button>
  </form>
</div>

<div class='card'>
  <h3>⚙️ NAT Advanced Settings</h3>
  <form action='/save-nat' method='get' id='natForm'>
    <input name='slots' id='natSlots' placeholder='Max NAPT Slots (64-4096)' value='512'>
    <input name='tcp' id='natTcp' placeholder='Max TCP ports (32-2048)' value='256'>
    <div id='ramWarning' class='warning' style='display:none; font-size:12px; margin:5px 0;'></div>
    <button type='submit'>💾 Save NAT Config & Reboot</button>
  </form>
  <small>⚠️ Slots phải >= TCP ports. Slots >1024 có thể gây thiếu RAM.</small>
</div>

<div class='card'><h3>👥 Connected Clients</h3><div id='ctable' style='font-size:12px;'>-</div></div>

<script>
let ws = new WebSocket('ws://' + location.hostname + '/ws');
ws.onmessage = e => {
    let d = JSON.parse(e.data);
    document.getElementById('ram').innerText = Math.round(d.ram/1024);
    document.getElementById('temp').innerText = d.temp;
    document.getElementById('net').innerText = d.internet ? 'ONLINE' : 'OFFLINE';
    document.getElementById('nat').innerText = d.nat ? 'ACTIVE' : 'OFF';
    document.getElementById('clientCount').innerText = d.clientCount;
    document.getElementById('clientLimit').innerText = d.clientLimit;
    let h = '';
    d.clients.forEach(c => { h += `<div>• ${c.ip} <small>[${c.mac}]</small></div>`; });
    document.getElementById('ctable').innerHTML = h || '<i>No clients</i>';
};

document.getElementById('scanBtn').onclick = async () => {
    let btn = document.getElementById('scanBtn');
    btn.innerText = '⏳ Scanning...';
    let r = await fetch('/scan');
    let nets = await r.json();
    let list = nets.map((n,i)=> i+": "+n.ssid+" ("+n.rssi+"dBm)").join("\n");
    let s = prompt("Select WiFi (enter number):\n"+list);
    if(s !== null && nets[s]) document.getElementById('ssidInp').value = nets[s].ssid;
    btn.innerText = '🔍 Scan WiFi';
};

document.getElementById('natSlots').addEventListener('input', function() {
    let slots = parseInt(this.value);
    let warningDiv = document.getElementById('ramWarning');
    if (slots > 1024) {
        warningDiv.style.display = 'block';
        warningDiv.innerHTML = '⚠️ Cảnh báo: ' + slots + ' slots có thể tiêu tốn >' + Math.round(slots * 0.1) + 'KB RAM. ESP32 có thể không ổn định!';
    } else {
        warningDiv.style.display = 'none';
    }
});

