nam348tnh3gp/ESP32-Repeater/src/ESP_Code.ino
document.getElementById('natForm').onsubmit = function() {
    let slots = parseInt(document.getElementById('natSlots').value);
    let tcp = parseInt(document.getElementById('natTcp').value);
    if (slots < tcp) {
        alert('❌ Lỗi: Slots (' + slots + ') phải lớn hơn hoặc bằng TCP ports (' + tcp + ')');
        return false;
    }
    return true;
};

fetch('/get-board-info').then(r=>r.json()).then(info=>{
    document.getElementById('boardInfo').innerHTML = `🔧 Board: ${info.model} | 5GHz: ${info.supports_5ghz ? '✅' : '❌'}`;
});
fetch('/get-nat-config').then(r=>r.json()).then(nat=>{
    document.getElementById('natSlots').value = nat.slots;
    document.getElementById('natTcp').value = nat.tcp;
});
</script></body></html>
)rawliteral";

// ================= SCAN HANDLER =================
void handleScan(AsyncWebServerRequest *r) {
    if (scanInProgress.exchange(true)) {
        r->send(429, "application/json", "[]");
        return;
    }

    WiFi.scanNetworks(true);
    int n = -1, timeout = 8000, elapsed = 0;

    while (n == -1 && elapsed < timeout) {
        delay(100);
        n = WiFi.scanComplete();
        elapsed += 100;
        esp_task_wdt_reset();
    }

    if (n <= 0) {
        WiFi.scanDelete();
        scanInProgress.store(false);
        r->send(500, "application/json", "[]");
        return;
    }

    // Sửa: Dùng DynamicJsonDocument
    DynamicJsonDocument doc(2048);
    JsonArray array = doc.to<JsonArray>();
    int limit = min(n, MAX_SCAN_NETWORKS);

    for (int i = 0; i < limit; i++) {
        JsonObject item = array.createNestedObject();  // Sửa: createNestedObject()
        item["ssid"] = WiFi.SSID(i);
        item["rssi"] = WiFi.RSSI(i);
    }

    String out;
    serializeJson(doc, out);
    WiFi.scanDelete();
    scanInProgress.store(false);
    r->send(200, "application/json", out);
}

// ================= NETWORK TASK =================
void networkTask(void * pv) {
    esp_task_wdt_add(NULL);
    static uint32_t lastBroadcast = 0;
    static bool natInitialized = false;
    static unsigned long lastTempUpdate = 0;
    static int lastClientCount = -1;

    for(;;) {
        esp_task_wdt_reset();
        uint32_t currHeap = heap_caps_get_free_size(MALLOC_CAP_8BIT);

        if (currHeap < MEM_CRITICAL_THRESHOLD && natEnabled.load()) {
            disableNAT();
            Serial.println("⚠️ Memory critical - NAT disabled");
        }

        if (WiFi.status() == WL_CONNECTED) {
            if (!natInitialized) {
                initNAT();
                natInitialized = true;
            }
            enableNAT();
            lastRSSI.store(WiFi.RSSI());
        } else {
            lastRSSI.store(-100);
            natInitialized = false;
        }

        if (millis() - lastTempUpdate > TEMP_UPDATE_INTERVAL) {
            lastTemp.store((int)(getTemperature() * 10));
            lastTempUpdate = millis();
        }

        if (millis() - lastBroadcast > 2000) {
            // Sửa: Dùng DynamicJsonDocument
            DynamicJsonDocument doc(4096);
            doc["ram"] = currHeap;
            doc["internet"] = internetOK.load();
            doc["nat"] = natEnabled.load();
            doc["rssi"] = lastRSSI.load();
            doc["temp"] = lastTemp.load() / 10.0;
            doc["uptime"] = (millis() - uptimeStart) / 1000;
            doc["clientCount"] = currentClients.load();
            doc["clientLimit"] = max_clients;

            JsonArray clis = doc.createNestedArray("clients");  // Sửa: createNestedArray()
            wifi_sta_list_t wifi_sta_list;
            esp_wifi_ap_get_sta_list(&wifi_sta_list);

            if (lastClientCount != wifi_sta_list.num) {
                lastClientCount = wifi_sta_list.num;
                Serial.printf("📡 Clients: %d/%d\n", lastClientCount, max_clients);
            }

            for (int i = 0; i < wifi_sta_list.num; i++) {
                JsonObject c = clis.createNestedObject();  // Sửa: createNestedObject()
                char m[18]; 
                sprintf(m, "%02X:%02X:%02X:%02X:%02X:%02X", 
                        wifi_sta_list.sta[i].mac[0], wifi_sta_list.sta[i].mac[1],
                        wifi_sta_list.sta[i].mac[2], wifi_sta_list.sta[i].mac[3],
                        wifi_sta_list.sta[i].mac[4], wifi_sta_list.sta[i].mac[5]);
                c["mac"] = m;
                c["ip"] = getIPFromMAC(wifi_sta_list.sta[i].mac);
            }

            String out;
            serializeJson(doc, out);
            ws.textAll(out);
            lastBroadcast = millis();
        }
        vTaskDelay(pdMS_TO_TICKS(1000));
    }
}

// ================= SETUP =================
void setup() {
    Serial.begin(115200);
    delay(100);
    uptimeStart = millis();

    detectBoardCapabilities();
    prefs.begin("apex-v21", false);

    // Load STA config
    sta_ssid = prefs.getString("sta_ssid", "");
    sta_pass = urlDecode(prefs.getString("sta_pass", ""));
    ap_ssid = prefs.getString("ap_ssid", "APEX_ULTRA");
    ap_pass = validateAPPassword(urlDecode(prefs.getString("ap_pass", "12345678")));

    if (board_supports_5ghz) {
        use_5ghz = prefs.getBool("use_5ghz", DEFAULT_BAND_5GHZ);
    }

    ap_channel = validateChannel(prefs.getInt("ap_channel", DEFAULT_AP_CHANNEL), use_5ghz);
    ap_hidden = prefs.getBool("ap_hidden", DEFAULT_AP_HIDDEN);
    max_clients = validateMaxClients(prefs.getInt("max_clients", DEFAULT_MAX_CLIENTS));
    dns_mode = prefs.getInt("dns_mode", DEFAULT_DNS_MODE);

    // Load NAT config
    int saved_tcp = validateNATTCP(prefs.getInt("nat_tcp", DEFAULT_NAPT_TCP));
    int saved_slots = validateNATSlots(prefs.getInt("nat_slots", DEFAULT_NAPT_SLOTS), saved_tcp);
    nat_max_slots = saved_slots;
    nat_max_tcp = saved_tcp;

    Serial.println("\n╔════════════════════════════════════════════════════╗");
    Serial.println("║   APEX ULTRA V21.1.0 - NAT Configurable         ║");
    Serial.println("║   Works on Arduino IDE & ESP-IDF                ║");
    Serial.println("╚════════════════════════════════════════════════════╝\n");
    Serial.printf("⚙️ NAT Slots: %d, TCP ports: %d\n", nat_max_slots, nat_max_tcp);

