nam348tnh3gp/ESP32-Repeater/src/ESP_Code.ino
    // Temperature sensor init
#ifndef CONFIG_IDF_TARGET_ESP32C5
    temp_sensor_config_t temp_sensor = TSENS_CONFIG_DEFAULT();
    temp_sensor.dac_offset = TSENS_DAC_L2;
    temp_sensor_set_config(temp_sensor);
    temp_sensor_start();
#endif

    // Setup WiFi AP
    WiFi.mode(WIFI_AP_STA);
    WiFi.softAPConfig(AP_IP, AP_GATEWAY, AP_SUBNET);
    WiFi.softAP(ap_ssid.c_str(), ap_pass.c_str(), ap_channel, ap_hidden ? 1 : 0, max_clients);

    Serial.printf("📡 AP: %s | Ch:%d | IP: %s\n", ap_ssid.c_str(), ap_channel, AP_IP.toString().c_str());

    // Register event handler
    ESP_ERROR_CHECK(esp_event_handler_instance_register(WIFI_EVENT, ESP_EVENT_ANY_ID,
                                                        &wifiEventHandler, NULL, NULL));

    // Connect to STA if configured
    if (sta_ssid.length() > 0) {
        WiFi.begin(sta_ssid.c_str(), sta_pass.c_str());
        Serial.printf("📡 Connecting to STA: %s\n", sta_ssid.c_str());
    } else {
        Serial.printf("⚠️ Connect to AP: %s | http://%s\n", ap_ssid.c_str(), AP_IP.toString().c_str());
    }

    // Web server routes
    server.on("/", HTTP_GET, [](AsyncWebServerRequest *r){ r->send_P(200, "text/html", index_html); });
    server.on("/scan", HTTP_GET, handleScan);

    server.on("/get-board-info", HTTP_GET, [](AsyncWebServerRequest *r){
        String json = "{\"model\":\"" + board_model + "\",\"supports_5ghz\":" + 
                      String(board_supports_5ghz ? "true" : "false") + "}";
        r->send(200, "application/json", json);
    });

    server.on("/get-nat-config", HTTP_GET, [](AsyncWebServerRequest *r){
        String json = "{\"slots\":" + String(nat_max_slots) + ",\"tcp\":" + String(nat_max_tcp) + "}";
        r->send(200, "application/json", json);
    });

    server.on("/save-sta", HTTP_GET, [](AsyncWebServerRequest *r){
        if(r->hasParam("ssid")) prefs.putString("sta_ssid", r->getParam("ssid")->value());
        if(r->hasParam("pass")) prefs.putString("sta_pass", r->getParam("pass")->value());
        r->send(200, "text/plain", "✅ STA Saved. Rebooting...");
        delay(1000);
        ESP.restart();
    });

    server.on("/save-ap", HTTP_GET, [](AsyncWebServerRequest *r){
        if(r->hasParam("ssid")) prefs.putString("ap_ssid", r->getParam("ssid")->value());
        if(r->hasParam("pass")) {
            String p = r->getParam("pass")->value();
            if (p.length() >= 8) prefs.putString("ap_pass", p);
        }
        if(r->hasParam("channel")) {
            int ch = r->getParam("channel")->value().toInt();
            prefs.putInt("ap_channel", validateChannel(ch, use_5ghz));
        }
        r->send(200, "text/plain", "✅ AP Saved. Rebooting...");
        delay(1000);
        ESP.restart();
    });

    server.on("/save-nat", HTTP_GET, [](AsyncWebServerRequest *r){
        int new_tcp = DEFAULT_NAPT_TCP;
        int new_slots = DEFAULT_NAPT_SLOTS;

        if(r->hasParam("tcp")) {
            new_tcp = validateNATTCP(r->getParam("tcp")->value().toInt());
            prefs.putInt("nat_tcp", new_tcp);
        }
        if(r->hasParam("slots")) {
            new_slots = validateNATSlots(r->getParam("slots")->value().toInt(), new_tcp);
            prefs.putInt("nat_slots", new_slots);
        }
        r->send(200, "text/plain", "✅ NAT Config Saved. Rebooting...");
        delay(1000);
        ESP.restart();
    });

    ws.onEvent([](AsyncWebSocket *s, AsyncWebSocketClient *c, AwsEventType t, void *arg, uint8_t *data, size_t len) {
        if (t == WS_EVT_DATA && len == 4 && memcmp(data, "ping", 4) == 0) {
            c->text("pong");
        }
    });
    server.addHandler(&ws);
    server.begin();
    setupDNS();

    // Internet check task
    xTaskCreatePinnedToCore([](void* p){ 
        esp_task_wdt_add(NULL);
        for(;;){ 
            esp_task_wdt_reset();
            if(WiFi.status() == WL_CONNECTED){
                WiFiClient c; 
                c.setTimeout(1500);
                internetOK.store(c.connect("1.1.1.1", 53)); 
                c.stop();
            } else {
                internetOK.store(false);
            }
            vTaskDelay(20000); 
        } 
    }, "CHK", 2048, NULL, 1, NULL, 1);

    // Sửa: WDT init cho core 3.x
    esp_task_wdt_config_t wdt_config = {
        .timeout_ms = WATCHDOG_TIMEOUT * 1000,
        .idle_core_mask = 0,
        .trigger_panic = true
    };
    esp_task_wdt_init(&wdt_config);
    esp_task_wdt_add(NULL);
    xTaskCreatePinnedToCore(networkTask, "NET", 8192, NULL, 4, NULL, 0);

    // Blink LED
    pinMode(LED_BUILTIN, OUTPUT);
    for (int i = 0; i < 3; i++) {
        digitalWrite(LED_BUILTIN, LOW); delay(80);
        digitalWrite(LED_BUILTIN, HIGH); delay(80);
    }

    Serial.printf("✅ APEX ULTRA V21.1.0 Ready on %s!\n", board_model.c_str());
}

void loop() { 
    dns.processNextRequest(); 
    vTaskDelay(10);
}
